Autodesk.Navisworks.Api.Schema.GuidFieldOwnershipType
Ownership semantics for a given GUID.

Autodesk.Navisworks.Api.Schema.GuidFieldOwnershipType.Generic
GUID has no implied meaning.

Autodesk.Navisworks.Api.Schema.GuidFieldOwnershipType.Identifier
Uniquely identifies a given resource. There are no ownership implications as this is on the resource itself.

Autodesk.Navisworks.Api.Schema.GuidFieldOwnershipType.UniqueReference
A unique reference to another resource. Ownership is implicit as no other resource can own this reference.

Autodesk.Navisworks.Api.Schema.GuidFieldOwnershipType.SharedReference
A shared reference to another resource. Ownership is akin to reference counting.

Autodesk.Navisworks.Api.Schema.GuidFieldOwnershipType.WeakReference
A reference to another resource that explicitly has no ownership. The reference may be invalid (i.e. the resource could be missing).

Autodesk.Navisworks.Api.Schema.GuidFieldOwnershipType.OwnerReference
A reference to another resource that explicitly has direct ownership. Similar to UniqueReference but may be referenced by WeakReference GUIDs.

Autodesk.Navisworks.Api.Schema.GuidFieldOwnershipType.ExternalReference
A reference to an external resource that is not specified via Identifier.